Revit 2022 API
InternalDefinition.ParameterType Property
Returns the user-visible interpretation of the parameter data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() method instead.")]
public override ParameterType ParameterType { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() method instead.")> _
Public Overrides ReadOnly Property ParameterType As ParameterType
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the GetDataType() method instead.")]
public:
virtual property ParameterType ParameterType {
	ParameterType get () override;
}
Remarks
The data within the parameter is stored as an integer, double, string or an element id. To the user these values may be more meaningful as Length, Volume, Mass etc. This parameter returns the interpretation that should be used for the data.
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace